app/views/todo_items/index.html.erb

SELECT "todo_items".* FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 2]]
SELECT COUNT(*) FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 5]]
---

<% if @todo_list.todo_items.size > 0 %>