app/views/todo_lists/_todo_list.html.erb

SELECT COUNT(*) FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 5]]
---
				<div class="small-10 medium-11 columns truncate" title="<%= todo_list.title %>"><%= todo_list.title %></div>
				<div class="small-2 medium-1 columns"><span class="label round"><%= todo_list.todo_items.size %></span></div>