app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.new(todo_item_params)
    if @todo_item.save
---
INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Eggs"], ["created_at", "2014-11-11 00:06:00.750341"], ["todo_list_id", 2], ["updated_at", "2014-11-11 00:06:00.750341"]]

  def edit
    @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 2], ["id", 1]]

  def complete
    @todo_item = @todo_list.todo_items.find(params[:id])
    @todo_item.toggle_completion!
---
SELECT  "todo_items".* FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 2], ["id", 1]]
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = 1  [["completed_at", "2014-11-11 19:11:51.045325"], ["updated_at", "2014-11-11 19:11:51.045859"]]

  def find_todo_list
    @todo_list = current_user.todo_lists.find(params[:todo_list_id])
---
SELECT  "todo_lists".* FROM "todo_lists"  WHERE "todo_lists"."user_id" = ? AND "todo_lists"."id" = ? LIMIT 1  [["user_id", 2], ["id", 2]]