app/controllers/todo_lists_controller.rb

INSERT INTO "todo_lists" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-19 21:43:02.397279"], ["description", "things"], ["title", "Stuff"], ["updated_at", "2014-06-19 21:43:02.397279"], ["user_id", 1]]
---
  def create
    @todo_list = current_user.todo_lists.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE "todo_lists" SET "title" = ?, "updated_at" = ? WHERE "todo_lists"."id" = 2  [["title", "Groceries"], ["updated_at", "2014-11-20 00:13:16.794998"]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

SELECT  "todo_lists".* FROM "todo_lists"  WHERE "todo_lists"."user_id" = ? AND "todo_lists"."id" = ? LIMIT 1  [["user_id", 2], ["id", 3]]
---
    def set_todo_list
      @todo_list = current_user.todo_lists.find(params[:id])