app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        @user.create_default_lists
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "todo_lists" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-19 01:57:29.379988"], ["title", "Odot Tutorial"], ["updated_at", "2014-11-19 01:57:29.379988"], ["user_id", 4]]